// Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.

int x, y = 0, z, b;
Console.WriteLine("Введите колличество цифр: ");
x = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число 1: ");
x = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число 2: ");
x = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число 3: ");
x = Convert.ToInt32(Console.ReadLine());
{
    if (x >= 0)
        Console.WriteLine("Положительных чисел: " + x);
        Console.ReadLine();
    }


